src/cf/Enums/СтатусыДокументовАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовАУСН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправленоВФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставленоВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатываетсяБанком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработаноБанком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработкиБанком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоПользователю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставленоПользователю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатываетсяПользователем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработаноПользователем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработкиПользователем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОтправкиВБанк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыДокументовАУСН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
#Область ПрограммныйИнтерфейс

// Возвращает идентификатор статуса документа сервиса Автоматизированная УСН
//
// Параметры:
//  Статус - ПеречислениеСссылка.СтатусыДокументовАУСН
//
// Возвращаемое значение:
//  Строка - строковый идентификатор статуса, указанного в параметре
//
Функция Идентификатор(Статус) Экспорт
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Возврат "";
	КонецЕсли;
	
	Статусы = ВсеСтатусы();
	Возврат Статусы[Статус];
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВсеСтатусы()
	
	Статусы = Новый Соответствие;
	Статусы.Вставить(ОтправленоВБанк, "SENT_TO_BANK");
	Статусы.Вставить(ДоставленоВБанк, "DELIVERED_TO_BANK");
	Статусы.Вставить(ОбрабатываетсяБанком, "IN_PROCESSING_BY_BANK");
	Статусы.Вставить(ОбработаноБанком, "PROCESSED_BY_BANK_SUCCESS");
	Статусы.Вставить(ОшибкаОбработкиБанком, "PROCESSED_BY_BANK_ERROR");
	Статусы.Вставить(ОтправленоПользователю, "SENT_TO_USER"); 
	Статусы.Вставить(ДоставленоПользователю, "DELIVERED_TO_USER");
	Статусы.Вставить(ОбрабатываетсяПользователем, "IN_PROCESSING_BY_USER");
	Статусы.Вставить(ОбработаноПользователем, "PROCESSED_BY_USER_SUCCESS");
	Статусы.Вставить(ОшибкаОбработкиПользователем, "PROCESSED_BY_USER_ERROR");
	Статусы.Вставить(ОжидаетОтправкиВБанк, "WAITING");
	
	Возврат Статусы; 
	
КонецФункции

#КонецОбласти
		
#КонецЕсли
